var province = document.getElementById('province');
var city = document.getElementById('city');
//省份
var provinceArr = [];
provinceArr[0] = ['110000','北京市'];
provinceArr[1] = ['120000','天津市'];
provinceArr[2] = ['310000','上海市'];
provinceArr[3] = ['500000','重庆市'];
provinceArr[4] = ['130000','河北省'];
provinceArr[5] = ['410000','河南省'];
provinceArr[6] = ['530000','云南省'];
provinceArr[7] = ['210000','辽宁省'];
provinceArr[8] = ['230000','黑龙江省']; 
provinceArr[9] = ['430000','湖南省']; 
provinceArr[10] = ['340000','安徽省'];
provinceArr[11] = ['370000','山东省'];
provinceArr[12] = ['650000','新疆维吾尔自治区']; 
provinceArr[13] = ['320000','江苏省'];
provinceArr[14] = ['330000','浙江省'];
provinceArr[15] = ['360000','江西省'];
provinceArr[16] = ['420000','湖北省'];
provinceArr[17] = ['450000','广西壮族自治区'];
provinceArr[18] = ['620000','甘肃省'];
provinceArr[19] = ['140000','山西省'];
provinceArr[20] = ['150000','内蒙古自治区'];
provinceArr[21] = ['610000','陕西省'];
provinceArr[22] = ['220000','吉林省'];
provinceArr[23] = ['350000','福建省'];
provinceArr[24] = ['520000','贵州省'];
provinceArr[25] = ['440000','广东省'];
provinceArr[26] = ['630000','青海省'];
provinceArr[27] = ['540000','西藏自治区'];
provinceArr[28] = ['510000','四川省'];
provinceArr[29] = ['640000','宁夏回族自治区'];
provinceArr[30] = ['460000','海南省'];
provinceArr[31] = ['710000','台湾省'];
provinceArr[32] = ['810000','香港特别行政区'];
provinceArr[33] = ['820000','澳门特别行政区'];

//市县,每个数组第一个元素为省份,其他的为这个省份下的市县
var cityArr = [];
cityArr[0] = ['北京市','东城区', '西城区','崇文区','宣武区','朝阳区','丰台区','石景山区', '海淀区','门头沟区', '房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区','密云县','延庆县'];
cityArr[1] = ['天津市','和平区','河东区', '河西区', '南开区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区', '宁河县', '静海县', '蓟县']; 
cityArr[2] = ['上海市','黄浦区','卢湾区', '徐汇区','长宁区','静安区','普陀区','闸北区','虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '南汇区', '奉贤区', '崇明县']; 
cityArr[3] = ['重庆市','万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区','江津区','合川区','永川区','南川区','綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']; 
cityArr[4] = ['河北省','石家庄市', '唐山市', '秦皇岛市', '邯郸市', '邢台市', '保定市', '张家口市', '承德市', '沧州市', '廊坊市', '衡水市']; 
cityArr[5] = ['河南省','郑州市','开封市','洛阳市', '平顶山市', '安阳市', '鹤壁市', '新乡市', '焦作市', '济源市', '濮阳市', '许昌市', '漯河市', '三门峡市', '南阳市', '商丘市', '信阳市', '周口市', '驻马店市']; 
cityArr[6] = ['云南省','昆明市',' 曲靖市','玉溪市','保山市','昭通市','丽江市','思茅市','临沧市','楚雄彝族自治州','红河哈尼族彝族自治州','文山壮族苗族自治州','西双版纳傣族自治州','大理白族自治州','德宏傣族景颇族自治州','怒江傈僳族自治州','迪庆藏族自治州']; 
cityArr[7] = ['辽宁省','沈阳市' ,'大连市' ,'鞍山市' ,'抚顺市' ,'本溪市' ,'丹东市' ,'锦州市' ,'营口市' ,'阜新市' ,'辽阳市' ,'盘锦市' ,'铁岭市' ,'朝阳市' ,'葫芦岛市']; 
cityArr[8] = ['黑龙江省','哈尔滨市','齐齐哈尔市','鸡西市','鹤岗市','双鸭山市', '大庆市', '伊春市', '佳木斯市', '七台河市', '牡丹江市', '黑河市', '绥化市', '大兴安岭地区']; 
cityArr[9] = ['湖南省','长沙市', '株洲市','湘潭市', '衡阳市', '邵阳市', '岳阳市', '常德市', '张家界市', '益阳市', '郴州市', '永州市', '怀化市', '娄底市', '湘西土家族苗族自治州']; 
cityArr[10] = ['安徽省','合肥市', '芜湖市', '蚌埠市', '淮南市', '马鞍山市', '淮北市', '铜陵市', '安庆市', '黄山市', '滁州市','阜阳市','宿州市', '巢湖市', '六安市', '亳州市', '池州市', '宣城市']; 
cityArr[11] = ['山东省','济南市','青岛市','淄博市','枣庄市','东营市','烟台市','潍坊市','济宁市','泰安市','威海市','日照市','莱芜市','临沂市','德州市','聊城市','滨州市','菏泽市'];
cityArr[12] = ['新疆维吾尔自治区','乌鲁木齐市', '克拉玛依市', '吐鲁番地区', '哈密地区', '昌吉回族自治州 ', '博尔塔拉蒙古自治州 ', '巴音郭楞蒙古自治州 ', '阿克苏地区', '克孜勒苏柯尔克孜自治州 ', '喀什地区', '和田地区', '伊犁哈萨克自治州', '塔城地区', '阿勒泰地区', '石河子市', '阿拉尔市', '图木舒克市', '五家渠市' ]; 
cityArr[13] = ['江苏省','南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市' ];
cityArr[14] = ['浙江省','杭州市', '宁波市', '温州市', '嘉兴市', '湖州市', '绍兴市', '金华市', '衢州市', '舟山市', '台州市', '丽水市']; 
cityArr[15] = ['江西省','南昌市','景德镇市','萍乡市','九江市','新余市','鹰潭市','赣州市','吉安市','宜春市','抚州市','上饶市'];
cityArr[16] = ['湖北省','武汉市','黄石市','十堰市', '宜昌市', '襄樊市', '鄂州市', '荆门市', '孝感市', '荆州市', '黄冈市', '咸宁市', '随州市', '恩施土家族苗族自治州','仙桃市', '潜江市', '天门市', '神农架林区'];
cityArr[17] = ['广西壮族自治区','南宁市','柳州市','桂林市','梧州市','北海市','防城港市','钦州市','贵港市','玉林市','百色市','贺州市','河池市','来宾市','崇左市'];
cityArr[18] = ['甘肃省','兰州市','嘉峪关市', '金昌市', '白银市', '天水市', '武威市', '张掖市', '平凉市', '酒泉市', '庆阳市', '定西市', '陇南市', '临夏回族自治州', '甘南藏族自治州'];
cityArr[19] = ['山西省','太原市','大同市', '阳泉市', '长治市', '晋城市', '朔州市', '晋中市', '运城市', '忻州市', '临汾市', '吕梁市' ];
cityArr[20] = ['内蒙古自治区','呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯市', '呼伦贝尔市', '巴彦淖尔市', '乌兰察布市', '兴安盟', '锡林郭勒盟', '阿拉善盟' ];
cityArr[21] = ['陕西省','西安市','铜川市','宝鸡市', '咸阳市', '渭南市', '延安市', '汉中市', '榆林市', '安康市', '商洛市' ];
cityArr[22] = ['吉林省','长春市', '吉林市', '四平市', '辽源市', '通化市', '白山市', '松原市', '白城市', '延边朝鲜族自治州'];
cityArr[23] = ['福建省','福州市', '厦门市', '莆田市', '三明市', '泉州市', '漳州市', '南平市', '龙岩市', '宁德市' ];
cityArr[24] = ['贵州省','贵阳市','六盘水市', '遵义市', '安顺市', '铜仁地区', '黔西南布依族苗族自治州', '毕节地区', '黔东南苗族侗族自治州', '黔南布依族苗族自治州'];
cityArr[25] = ['广东省','广州市','韶关市','深圳市','珠海市','汕头市','佛山市','江门市','湛江市','茂名市','肇庆市','惠州市','梅州市','汕尾市','河源市','阳江市','清远市','东莞市','中山市','潮州市','揭阳市','云浮市'];
cityArr[26] = ['青海省','西宁市' ,'海东地区', '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州'];
cityArr[27] = ['西藏自治区','拉萨市','昌都地区', '山南地区', '日喀则地区', '那曲地区', '阿里地区', '林芝地区' ];
cityArr[28] = ['四川省','成都市','自贡市', '攀枝花市', '泸州市', '德阳市', '绵阳市', '广元市', '遂宁市', '内江市', '乐山市', '南充市', '眉山市', '宜宾市', '广安市', '达州市', '雅安市', '巴中市', '资阳市', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州'];
cityArr[29] = ['宁夏回族自治区','银川市','石嘴山市','吴忠市','固原市','中卫市'];
cityArr[30] = ['海南省','海口市','三亚市','五指山市', '琼海市', '儋州市', '文昌市', '万宁市', '东方市', '定安县', '屯昌县', '澄迈县', '临高县', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县', '陵水黎族自治县', '保亭黎族苗族自治县', '琼中黎族苗族自治县' ];
cityArr[31] = ['台湾省','台北市', '高雄市', '基隆市', '台中市', '台南市', '新竹市', '嘉义市'];
cityArr[32] = ['香港特别行政区','中西区', '湾仔区', '东区', '南区', '油尖旺区', '深水埗区', '九龙城区', '黄大仙区', '观塘区', '荃湾区', '葵青区', '沙田区', '西贡区', '大埔区', '北区', '元朗区', '屯门区', '离岛区' ];
cityArr[33] = ['澳门特别行政区','澳门'];
//cityid
var cityIdArr = [];
cityIdArr[0] = ['110000','110100', '110200','110300','110400','110500','110600','110700', '110800','110900', '111000','111100','111200','111300','111400','111500','111600','111700','111800'];
cityIdArr[1] = ['120000','120100','120200', '120300', '120400', '120500', '120600', '120700', '120800', '120900', '121000', '121100', '121200', '121300', '121400', '121500', '121600', '121700', '121800']; 
cityIdArr[2] = ['310000','310100','310200', '310300','310400','310500','310600','310700','310800', '310900', '311000', '311100', '311200', '311300', '311400', '311500', '311600', '311700', '311800', '311900']; 
cityIdArr[3] = ['500000','500100','500200','500300','500400','500500','500600','500700','500800','500900','501000','501100','501200','501300','501400','501500','501600','501700','501800','501900','502000','502100','502200','502300','502400','502500','502600','502700','502800','502900','503000','503100','503200','503300','503400','503500','503600','503700','503800','503900','504000']; 
cityIdArr[4] = ['130000','130100', '130200', '130300', '130400', '130500', '130600', '130700', '130800', '130900', '131000', '131100']; 
cityIdArr[5] = ['410000','410100','410200','410300', '410400', '410500', '410600', '410700', '410800', '410850', '410900', '411000', '411100', '411200', '411300', '411400', '411500', '411600', '411700']; 
cityIdArr[6] = ['530000','530100',' 530300','530400','530500','530600','530700','530800','530900','532300','532500','532600','532800','532900','533100','533300','533400']; 
cityIdArr[7] = ['210000','210100' ,'210200' ,'210300' ,'210400' ,'210500' ,'210600' ,'210700' ,'210800' ,'210900' ,'211000' ,'211100' ,'211200' ,'211300' ,'211400']; 
cityIdArr[8] = ['230000','230100','230200','230300','230400','230500', '230600', '230700', '230800', '230900', '231000', '231100', '231200', '232700']; 
cityIdArr[9] = ['430000','430100', '430200','430300', '430400', '430500', '430600', '430700', '430800', '430900', '431000', '431100', '431200', '431300', '433100']; 
cityIdArr[10] = ['340000','340100', '340200', '340300', '340400', '340500', '340600', '340700', '340800', '341000', '341100','341200','341300', '341400', '341500', '341600', '341700', '341800']; 
cityIdArr[11] = ['370000','370100','370200','370300','370400','370500','370600','370700','370800','370900','371000','371100','371200','371300','371400','371500','371600','371700'];
cityIdArr[12] = ['650000','650100', '650200', '652100', '652200', '652300 ', '652700 ', '652800 ', '652900', '653000 ', '653100', '653200', '654000', '654200', '654300', '654400', '654500', '654600', '654700' ]; 
cityIdArr[13] = ['320000','320100', '320200', '320300', '320400', '320500', '320600', '320700', '320800', '320900', '321000', '321100', '321200', '321300' ];
cityIdArr[14] = ['330000','330100', '330200', '330300', '330400', '330500', '330600', '330700', '330800', '330900', '331000', '331100']; 
cityIdArr[15] = ['360000','360100','360200','360300','360400','360500','360600','360700','360800','360900','361000','361100'];
cityIdArr[16] = ['420000','420100','420200','420300', '420500', '420600', '420700', '420800', '420900', '421000', '421100', '421200', '421300', '422800','422900', '423000', '423100', '423200'];
cityIdArr[17] = ['450000','450100','450200','450300','450400','450500','450600','450700','450800','450900','451000','451100','451200','451300','451400'];
cityIdArr[18] = ['620000','620100','620200', '620300', '620400', '620500', '620600', '620700', '620800', '620900', '621000', '621100', '621200', '622900', '623000'];
cityIdArr[19] = ['140000','140100','140200', '140300', '140400', '140500', '140600', '140700', '140800', '140900', '141000', '141100' ];
cityIdArr[20] = ['150000','150100', '150200', '150300', '150400', '150500', '150600', '150700', '150800', '150900', '152200', '152500', '152900' ];
cityIdArr[21] = ['610000','610100','610200','610300', '610400', '610500', '610600', '610700', '610800', '610900', '611000' ];
cityIdArr[22] = ['220000','220100', '220200', '220300', '220400', '220500', '220600', '220700', '220800', '222400'];
cityIdArr[23] = ['350000','350100', '350200', '350300', '350400', '350500', '350600', '350700', '350800', '350900' ];
cityIdArr[24] = ['520000','520100','520200', '520300', '520400', '522200', '522300', '522400', '522600', '522700'];
cityIdArr[25] = ['440000','440100','440200','440300','440400','440500','440600','440700','440800','440900','441200','441300','441400','441500','441600','441700','441800','441900','442000','445100','445200','445300'];
cityIdArr[26] = ['630000','630100' ,'632100', '632200', '632300', '632500', '632600', '632700', '632800'];
cityIdArr[27] = ['540000','540100','542100', '542200', '542300', '542400', '542500', '542600' ];
cityIdArr[28] = ['510000','510100','510300', '510400', '510500', '510600', '510700', '510800', '510900', '511000', '511100', '511300', '511400', '511500', '511600', '511700', '511800', '511900', '512000', '513200', '513300', '513400'];
cityIdArr[29] = ['640000','640100','640200','640300','640400','640500'];
cityIdArr[30] = ['460000','460100','460200','460300', '460400', '460500', '460600', '460700', '460800', '460900', '461000', '461100', '461200', '461300', '461400', '461500', '461600', '461700', '461800' ];
cityIdArr[31] = ['710000','710100', '710200', '710300', '710400', '710500', '710600', '710700'];
cityIdArr[32] = ['810000','810100', '810200', '810300', '810400', '810500', '810600', '810700', '810800', '810900', '811000', '811100', '811200', '811300', '811400', '811500', '811600', '811700', '811800' ];
cityIdArr[33] = ['820000','820100'];

//生成省份
for(var i = 0; i < provinceArr.length; i++) {
		var provinceOption = document.createElement('option');
		provinceOption.value = provinceArr[i][0];
		provinceOption.text = provinceArr[i][1];
		province.options.add(provinceOption);
}
//生成市县、区市'
//@current为当前选择的select节点，即父类节点
//@child为子类点
//@childArr为子节点数组
function showChild(current, child, childArr,childIdArr) {
		var currentValue = current.value;
		var count = childArr.length;
		//每次切换省,重新取得下属城市或直辖市所属区
		child.length = 1;
		for(var i = 0; i < count; i++) {
				//判断所选的值是否是省
			   	if(currentValue == childIdArr[i][0]) {
						//因为数组中第一个元素是'省'，所以要从'市'开始
						for(var j = 1; j < childArr[i].length; j++) {
								var childOption = document.createElement('option');
								//ie不支持option对象的value,所以加childOption.text
								childOption.value = childIdArr[i][j];
								childOption.text = childArr[i][j];
								child.options.add(childOption); 
						}
				}
		}
}
//省份改变市
province.onchange = function() {
		showChild(province, city, cityArr,cityIdArr);
}